--- a/docs/introductions/sdlc_tools.md
+++ b/docs/introductions/sdlc_tools.md
@@ -57,21 +57,11 @@ html comment
 5.	Development and maintenance
 
 
-```graphviz
-digraph {
-   rankdir=LR;
-  "Requirements" -> "Analysis and design" -> "Development" -> Test -> "Development and maintenance";
-}
+```mermaid
+flowchart 
+    "Requirements" --> "Analysis and design" --> "Development" --> Test --> "Development and maintenance" --> "Requirements"
 ```
 
-```graphviz
-digraph G {
